# PipeFittingAndAccessoryPressureDropUIData Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipeFittingAndAccessoryPressureDropUIData Class
Members See Also
---
The input and output data used by external UI servers for storing UI settings.
**Namespace:** Autodesk.Revit.UI.Plumbing**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class PipeFittingAndAccessoryPressureDropUIData : IDisposable
```

Visual Basic
---
```text
Public Class PipeFittingAndAccessoryPressureDropUIData _
	Implements IDisposable
```

Visual C++
---
```text
public ref class PipeFittingAndAccessoryPressureDropUIData : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.UI.Plumbing..::..PipeFittingAndAccessoryPressureDropUIData
# See Also
PipeFittingAndAccessoryPressureDropUIData Members
Autodesk.Revit.UI.Plumbing Namespace